---
kind: method
id: M:Autodesk.Revit.DB.CategoryNameMap.GetEnumerator
source: html/f7eb867b-e9c8-1a42-3d34-f082bfa48583.htm
---
# Autodesk.Revit.DB.CategoryNameMap.GetEnumerator Method

Retrieve a forward moving iterator to the map.

## Syntax (C#)
```csharp
public virtual IEnumerator GetEnumerator()
```

## Returns
Returns a forward moving iterator to the map.